import { ReviewCardDTO } from '@/shared/types/ReviewCardDTO.interface'

export const reviews: ReviewCardDTO[] = [
	{
		id: 'r1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 5,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'company'
	},
	{
		id: 'rsdggf1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 2,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'dealer'
	},
	{
		id: 'rsdssf1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'rf1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 2,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'company'
	},
	{
		id: 'rs1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 5,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'dealer'
	},
	{
		id: 'rdf1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 4,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'rsd90df1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 1,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'dealer'
	},
	{
		id: 'msswe2',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'm42',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'company'
	},
	{
		id: 'msswe3',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'msswe4',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'msswe5',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'msswe6',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'msswe7',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'msswe8',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'msswe9',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw1',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw2',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw3',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw4',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw5',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw6',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw7',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	},
	{
		id: 'mssw8',
		author: 'ООО "СтройЛидер"',
		city: 'Краснодар',
		rating: 3,
		text: 'Заказывали плитку для благоустройства 5 дворов. Продукция выдержала 3 зимы без повреждений.',
		type: 'private'
	}
]
